app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Me "], ["body", "Very nice comment here!"], ["article_id", 4], ["created_at", "2022-01-19 22:51:27.878640"], ["updated_at", "2022-01-19 22:51:27.878640"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)